Tekla.Structures.Internal.dotIdentifier_t.CreateTeklaStructuresGuid(Tekla.Structures.Identifier)
Creates a guid in Tekla Structures Format (add "ID" in front).
identifier: The identifier to create from.

Tekla.Structures.Internal.dotIdentifier_t.GetGuidFromMaybeTsGuid(System.String)
Construct a Guid object from a guid string (36 chars) or from a Tekla Structures guid (38 chars).
maybeTsGuid: Tekla Structures guid or normal guid.
Returns: The constructed guid